app/views/homepage/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <li class="nav-item active" id="links-log">
        <% unless User.find_by_id(session[:current_user_id]).nil? %>