app/views/personal_account/main_page.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <div class="container ml-5 mt-4 m-3 pt-3 border border-success rounded table-danger">
          <% user = User.find_by(id: session[:current_user_id]) %>