app/controllers/common_actions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = ? LIMIT ?  [["login", "7562862836"], ["LIMIT", 1]]
---
  def show_inn_output
    @user_from_db = User.find_by(login: @user_login)

SELECT "users".* FROM "users" WHERE "users"."inn" = ? LIMIT ?  [["inn", 284913488189], ["LIMIT", 1]]
---
  def clear_business_output
    @user_from_db = User.find_by(inn: @user_inn)