app/controllers/log_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = ? LIMIT ?  [["login", "login"], ["LIMIT", 1]]
---
  def sign_in
    if User.find_by(login: @login).nil?
      @msg << 'This email is not registered'
      return
    end
    user = User.find_by(login: @login)