app/controllers/personal_functions_controller.rb

  def add_income_output
    if @income.match?(/\A[1-9]\d*\z/)
      @income = @income.to_i
      @current_user.update_column(:income, @income)
      @current_user.update_column(:tax, @income * 0.13)
---
UPDATE "users" SET "income" = ? WHERE "users"."id" = ?  [["income", 1000000], ["id", 1]]
UPDATE "users" SET "tax" = ? WHERE "users"."id" = ?  [["tax", 130000], ["id", 1]]

  def add_realty_output
    @new_realty = Realty.new(user_id: session[:current_user_id], address: @address, square: @square.to_i,
                             cost: @cost.to_i)
    if @new_realty.valid?
      @new_realty.save
---
INSERT INTO "realties" ("address", "square", "cost", "realty_tax", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def add_vehicle_output
    @new_vehicle = Vehicle.new(user_id: session[:current_user_id], license_plate: @license_plate, model: @model,
                               power: @power)
    if @new_vehicle.valid?
      @new_vehicle.save
---
INSERT INTO "vehicles" ("license_plate", "model", "power", "vehicle_tax", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def pay_output
    if @sum.match?(/\A[1-9]\d*\z/)
      @sum = @sum.to_i
      @tax_payed = @current_user.tax_payed + @sum
      @current_user.update_column(:tax_payed, @tax_payed)
---
UPDATE "users" SET "tax_payed" = ? WHERE "users"."id" = ?  [["tax_payed", 30000], ["id", 1]]

  def set_common_params
    @current_user = User.find_by(id: session[:current_user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]