app/controllers/users_controller.rb

INSERT INTO "users" ("login", "password_digest", "income", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["login", "123"], ["password_digest", "[FILTERED]"], ["income", nil], ["position", "физическое лицо"], ["created_at", "2022-12-24 09:54:24.440745"], ["updated_at", "2022-12-24 09:54:24.440745"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save