app/models/user.rb

  def taxes
    result = 0
    realties = Realty.where(user_id: id)
    vehicles = Vehicle.where(user_id: id)
    result += tax
    realties.each { |object| result += object.realty_tax } unless realties.empty?
    vehicles.each { |object| result += object.vehicle_tax } unless vehicles.empty?
---
SELECT "realties".* FROM "realties" WHERE "realties"."user_id" = ?  [["user_id", 1]]
SELECT "realties".* FROM "realties" WHERE "realties"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "realties" WHERE "realties"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "vehicles" WHERE "vehicles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]