app/views/personal_functions/payments_info.html.erb

<div id="payments_container" class="container m-3">
  <% realties = Realty.where(user_id: @current_user.id) %>
  <% vehicles = Vehicle.where(user_id: @current_user.id) %>
---
SELECT "realties".* FROM "realties" WHERE "realties"."user_id" = ?  [["user_id", 1]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = ?  [["user_id", 1]]