app/views/personal_functions/posession_info.html.erb

  <h6><%= t('income_tax') %> <%= @current_user.tax %> ₽</h6>
  <% realties = Realty.where(user_id: @current_user.id) %>
  <% vehicles = Vehicle.where(user_id: @current_user.id) %>
---
SELECT "realties".* FROM "realties" WHERE "realties"."user_id" = ?  [["user_id", 2]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = ?  [["user_id", 2]]